Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཆོས་རྣམས་སྟོང་པར་རིག་ནས་ནི། །བྱང་ཆུབ་ཉིད་ཀྱང་སྟོང་པ་ཡིན། །
en: When you recognize that phenomena are empty, You will see that even awakening is empty.

source: འདོད་ཆགས་ཞེ་སྡང་དེ་བཞིན་གཏི་མུག་དང་། །མེ་གསུམ་དེ་དག་ཤིན་ཏུ་མི་བཟད་པ། །དེས་ནི་འཇིག་རྟེན་འདི་ཀུན་རབ་འབར་ཡང་། །བྱིས་པ་རིང་ནས་གཉིད་ལོག་ཁོང་མི་ཆུད། །
en: “Passion, aggression, and delusion— The fury of these three fires is terrible. Even though they are incinerating this world, Fools do not wake from their long sleep.

source: སྐྱེ་དང་རྒ་དང་ན་དང་འཆི་བ་དང་། །སྨྲེ་སྔགས་འདོན་དང་སྡུག་བསྔལ་ཡིད་མི་བདེས། །འཇིག་རྟེན་འདི་དག་གཙེས་པར་རིག་ནས་ནི། །ཆོས་རྣམས་ཀུན་ལ་གནས་པར་མ་བྱེད་ཅིག །
en: “Birth, aging, sickness, and death And despair, suffering, and depression afflict the world. When you realize this, Do not place your trust in any of these phenomena.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་བྱུང་བ་རྙེད་པར་གྱུར་ཅིག ། བདག་ཅག་རྣམས་ཀྱིས་བདེ་བར་གཤེགས་པ་ལས་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་རྙེད་པར་གྱུར་ཅིག །
en: The five hundred householders then addressed the Lord, “Lord, we wish to become renunciants in the presence of the Lord. We wish to receive ordination as mendicants in the presence of the Sugata.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དག་ཚུར་ཤོག་ཅེས་གསུངས་པ་དང་། དེ་ཉིད་ཀྱིས་ཚེ་དང་ལྡན་པ་དེ་དག་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: The Lord replied, “Come mendicants!”

source: དེ་ཉིད་ཀྱིས་བསྙེན་པར་རྫོགས་པ་དང་། དེ་ཉིད་ཀྱིས་དགེ་སློང་གི་དངོས་པོར་གྱུར་ཏོ། ། འདི་ལ་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ་དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །
en: At with that, those venerable ones became renunciants and were ordained as mendicants. This is the way things are, and concerning it the following verses were recited:

source: དེ་དག་གིས་ནི་ངུར་སྨྲིག་བགོས། །
en: “They have clothed themselves in ochre,

source: དེ་དག་གིས་ནི་སྐྲ་ཡང་བྲེགས། །
en: They have now cut off their hair,

source: ཀུན་ཀྱང་ལྷུང་བཟེད་ཐོགས་གྱུར་ནས། །
en: They have all adopted the alms bowl,

source: དེ་ཉིད་དུ་ནི་དགྲ་བཅོམ་གྱུར། །
en: And are in this instant arhats.

source: སྟོན་པས་དགྲ་བཅོམ་རབ་མཁྱེན་ནས། །དགེ་སློང་གི་ནི་དགེ་འདུན་དང་། །ལྷ་རྣམས་མདུན་དུ་མངོན་སུམ་དུ། །ཆེད་དུ་རྗོད་པ་ཆེད་དུ་རྗོད། །
en: “The teacher has recognized them as arhats And will now utter some verses of inspiration In the presence of the community of mendicants And the assembly of gods.

source: འཇིག་རྟེན་གྱི་ནི་མགོན་པོ་ལ། །སྔོན་ཆད་སྦྱིན་པ་བྱིན་པས་ན། །གང་ན་བདེ་བ་མང་བ་དེར། །ཤིན་ཏུ་དགའ་ཞིང་འོངས་པར་གྱུར། །
en: “In the past they offered gifts To the protector of the world, And because of this They experienced abundant joy.

source: དེ་དག་གིས་ནི་ང་མཐོང་ནས། །
en: “When they saw me,

source: དད་པས་རབ་ཏུ་སྐྱེད་པར་གྱུར། །
en: Faith arose in them,

source: དེ་དག་སེམས་ནི་དང་བ་ལ། །ཆོས་རྣམས་ཀྱི་ནི་མཆོག་བསྟན་ཏོ། །
en: And to those whose minds are filled with faith The highest Dharma is taught.

source: དགྲ་བཅོམ་གྱི་ནི་གསུངས་ཐོས་ནས། །
en: “Having now heard the words of the Arhat,

source: བདག་ཏུ་ལྟ་བ་རྣམ་པར་བཤིག །
en: They abandon their fondness for egoistic views.

source: སྟོང་ཉིད་མངོན་དུ་བྱས་ནས་ནི། །དེ་དག་སྐྱེ་བ་ཀུན་ལས་གྲོལ། །
en: With emptiness revealed, They are liberated from all birth.”

source: ཁྱིམ་བདག་གི་ལེའུ་ཞེས་བྱ་སྟེ་དང་པོའོ།། །།
en: This is the first chapter, “The Householders.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལམ་གྱི་བར་དུ་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་པོ་མི་གཡོ་བའི་གནས་ལ་བཀོད་ནས་ཀུན་ནས་མཛེས་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་སོ། །
en: After the Lord had left the five hundred householders in a balanced state of mind on his way to the city, he entered the great city of Rājagṛha with perfect grace.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་གྱི་ལྷ་རྣམས་དང་། གནོད་སྦྱིན་ཅི་འཇིགས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་གིས་འདི་ལྟ་བུ་སྦྱིན་གནས་འཇིག་རྟེན་ན་ཤིན་ཏུ་དཀོན་པའི་བཅོམ་ལྡན་འདས་ལ་བསོད་སྙོམས་དབུལ་ལོ་སྙམ་མོ། །
en: One of the city deities of Rājagṛha was a yakṣa named Kimbhīra. He thought to himself, “In this world, it is extremely rare to encounter anyone who is such a worthy recipient of offerings. We should make offerings to the Lord.”

source: དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱིས་བསོད་སྙོམས་ཁ་དོག་ཕུན་སུམ་ཚོགས་པ། དྲི་ཕུན་སུམ་ཚོགས་པ། རོ་ཕུན་སུམ་ཚོགས་པ། རེག་པ་ཕུན་སུམ་ཚོགས་པ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས་ གནོད་སྦྱིན་ཅི་འཇིགས་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བསོད་སྙོམས་དེ་བཞེས་སོ། ། བཅོམ་ལྡན་འདས་ལ་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱིས་བསོད་སྙོམས་ཕུལ་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟེང་གི་བར་སྣང་ལས་ཅི་འཇིགས་ཀྱི་འཁོར་མང་པོ་གནོད་སྦྱིན་དྲུག་ཁྲི་བརྒྱད་སྟོང་གིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ
en: The yakṣa Kimbhīra then presented the Lord with offerings that looked exquisite, smelled exquisite, tasted exquisite, and felt exquisite, and because of his empathy for Kimbhīra, the Lord accepted his offerings. When Kimbhīra had given his offerings to the Lord, cheers of “Wonderful!” arose from a great crowd of sixty-eight thousand yakṣas surrounding Kimbhīra in the sky.

source: རྗེས་སུ་ཡི་རང་བའི་སྒྲ་ཕྱུང་ངོ་། ། དེ་ནས་དེའི་ཕྱིར་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱིས་རང་གི་འཁོར་རྣམས་ལ་བོས་ཏེ། བདག་གིས་ནི་ད་གཟོད་དེ་བཞིན་གཤེགས་པ་ལ་བསོད་སྙོམས་ཕུལ་གྱིས། ཁྱེད་ཀྱིས་ནི་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཕུལ་ཅིག ། དེ་ནི་ཁྱེད་རྣམས་ཀྱི་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་བདེ་བར་འགྱུར་རོ། །
en: Kimbhīra then addressed his followers: “As we have now made offerings to the Tathāgata, you should also present offerings to the community of mendicants. This will benefit you, help you, and bring you long-lasting happiness.”

source: གནོད་སྦྱིན་རྣམས་ཀྱིས་དགེ་སློང་གི་དགེ་འདུན་ལ་བསོད་སྙོམས་ཕུལ་ནས་གནོད་སྦྱིན་དེ་དག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཀྱང་བསོད་སྙོམས་བླངས་སོ། །
en: The yakṣas then presented the community of mendicants with offerings, and the mendicants accepted the offerings because of their empathy for the yakṣas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་པ་ལས་དེས་བསོད་སྙོམས་བླངས་པར་མཁྱེན་ནས་ཕྱོགས་དེ་ནས་སླར་ལོག་གོ ། དེ་ལྟར་དེའི་ཚེ་ལྷ་སྟོང་ཕྲག་དུ་མ་དང་། ཀླུ་སྟོང་ཕྲག་དུ་མ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་སྟོང་ཕྲག་དུ་མ་དང་། མི་དང་མི་མ་ཡིན་པ་སྟོང་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་རྣམས་བཅོམ་ལྡན་འདས་གཤེགས་པའི་ཞབས་འབྲིང་དུ་དོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་ས་ཕྱོགས་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ཞིག་ཏུ་གཤེགས་ཏེ་བྱོན་ནས་གདན་བཤམས་པ་ལ་བཞུགས་སོ། ། དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་འཁོར་དང་བཅས་པས་ལྷའི་མེ་ཏོག་མན་དཱ་ར་དང་། ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་བླངས་ཏེ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་གཏོར། མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ཏོ། ། གཏོར་མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བསམ་པ་ཡང་མཁྱེན། དེའི་འཁོར་གནོད་སྦྱིན་མང་པོའི་བསམ་པ་ཡང་མཁྱེན་ནས་འཛུམ་པ་མཛད་དོ། །
en: After he had entered the great city of Rājagṛha and received offerings, the Lord left the city. The Lord was accompanied by many thousands of gods, many thousands of nāgas, many thousands of yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, and many thousands of human and nonhuman beings, and many hundreds, thousands, millions, and billions of beings. After he left the city, the Lord went to a large, spacious clearing and sat down on the seat prepared for him. Kimbhīra worshiped the Lord by sprinkling, overspreading, and showering the Lord with heavenly mandārava flowers, blue, pink, red, and white lotus flowers, and heavenly sandalwood powder. When he had sprinkled, overspread, and showered him with these offerings, he stood in front of him with his hands joined in reverence. The Lord perceived Kimbhīra’s state of mind and that of the rest of the large group of yakṣas, and he smiled.

source: ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། ནམ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཛུམ་པ་མཛད་པ་དེ་ན་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་སྟེ། དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བས་ཁྱབ་པར་བྱས་ནས་ཉི་མ་དང་ཟླ་བའི་གཟི་བརྗིད་མེད་པར་བྱས་ཏེ། སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ཏེ། སླར་ལོག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ། ཁ་ཅིག་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །ཁ་ཅིག་ནི་ཕྲག་པར་ནུབ་བོ། །ཁ་ཅིག་ནི་པུས་མོར་ནུབ་བོ། །ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། ནམ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་ཞབས་གཉིས་ཀྱི་འོག་ཏུ་ནུབ་པར་འགྱུར་རོ། ། ནམ་དུད་འགྲོའི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་སྣམ་ལོགས་སུ་ནུབ་པར་འགྱུར་རོ། ། ནམ་གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་མདུན་དུ་ནུབ་པར་འགྱུར་རོ། ། ནམ་མི་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་གཡོན་དུ་ནུབ་པར་འགྱུར་རོ། ། ནམ་ལྷ་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་གཡས་སུ་ནུབ་པར་འགྱུར་རོ། ། ནམ་ཉན་ཐོས་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་པུས་མོར་ནུབ་པར་འགྱུར་རོ། ། ནམ་རང་སངས་རྒྱས་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་ཕྲག་པར་ནུབ་པར་འགྱུར་རོ། ། ནམ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་སྟེང་གི་དབུའི་གཙུག་གི་མཚམས་སུ་ནུབ་པར་འགྱུར་རོ། །
en: It is in the nature of the buddhas, the lords, that when they smile, multicolored, variegated light issues from their mouths. This light is blue, yellow, red, white, crimson, crystal, and silver, and it spreads throughout the world, outshining the radiance of the sun and the moon. It travels from the beings of hell all the way up to the world of the brahmā gods, rising and then returning again, circling the lord clockwise seven times. Some parts of it then dissolve into the crown of the lord’s head, some into his shoulders, and some into his knees. It is in the nature of the buddhas, the lords, that when they make predictions for the beings of hell, this light dissolves into the soles of their feet. When they make predictions for the beings of the animal realm, the light dissolves into their back. When they make predictions for the beings of the spirit world governed by Yama, the light dissolves into their front. When they make predictions for human beings, the light dissolves into their left side. When they make predictions for the gods, the light dissolves into their right side. When they make predictions for śrāvakas, the light dissolves into their knees. When they make predictions for pratyekabuddhas, the light dissolves into their shoulders. When the buddhas, the lords, make predictions that bodhisatvas will attain unsurpassed perfect awakening, the light dissolves into the crown of their head.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་མཐོང་སྟེ། མཐོང་ནས་ ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ཏེ་ པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: The venerable Ānanda saw the Lord smile, and so he placed his robe over one shoulder, knelt down on his right knee, joined his hands in reverence, and addressed the Lord in verse:

source: ཅི་རྒྱུས་འཇིག་རྟེན་སྣང་མཛད་པ། །འཇིག་རྟེན་ཀུན་ལ་སྨན་པའི་སླད། །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །ཅི་ཞིག་སླད་དུ་འཛུམ་པ་བསྟན། །
en: “What is the cause of this illumination of the world, This radiance of the protector of the world? For the sake of whom is the smile displayed, It being something that benefits the world?

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །དེ་རིང་སུ་ཡིས་ས་བོན་བཏབ། །
en: “Who has sown a seed today That will lead to their awakening as a buddha?

source: དེ་རིང་སུ་ལ་ལུང་ཡང་སྟོན། །
en: For whom was a prediction made today?

source: གང་ཞིག་ཐར་ཕྱིར་རབ་ཏུ་ཞུགས། །
en: Who is destined for awakening?

source: དཔའ་བོ་རྣམ་པར་འདྲེན་པ་རྣམས། །རྒྱུ་མ་མཆིས་པར་འཛུམ་མི་མཛད། །
en: “The heroes, the guides, Do not smile without a reason.

source: ཐུབ་པ་ཅི་སླད་འཛུམ་པ་བསྟན། ། འོད་ཟེར་དོན་ནི་བཤད་དུ་གསོལ། །
en: Tell us, O sage, what is the purpose of these rays of light?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་སླར་གསུངས་པ། །འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ལ། །ཅི་འཇིགས་རབ་ཏུ་དད་སེམས་ཀྱིས། །བསོད་སྙོམས་དག་ནི་ཕུལ་བས་ན། །
en: For the sake of whom are they displayed?” The Lord then replied to the venerable Ānanda in verse: “Kimbhīra gave offerings to the protector, The guardian of the world, With a mind filled with faith.

source: དེ་ལྟར་དེ་ཕྱིར་འཛུམ་པ་མཛད། །
en: That is why I smiled.

source: གནོད་སྦྱིན་འདི་ནས་ཤི་འཕོས་ནས། །
en: “When he passes on from this birth as a yakṣa,

source: སུམ་ཅུ་རྩ་གསུམ་འགྲོ་བར་འགྱུར། །
en: He will go to the Heaven of the Thirty-Three.

source: སུམ་ཅུ་གསུམ་ནས་ཤི་འཕོས་ནས། །
en: When he passes on from the Thirty-Three,

source: འཐབ་བྲལ་དུ་ཡང་འགྲོ་བར་འགྱུར། །
en: He will go to the realm of the yāma gods.

source: འཐབ་བྲལ་ནས་ནི་དགའ་ལྡན་འགྲོ། །
en: “From the yāma gods he will go to Tuṣita

source: འདོད་ལ་འདོད་པས་དགར་བྱས་ནས། །
en: And delight in its pleasures.

source: མི་ཡི་ནང་དུ་སྐྱེ་འགྱུར་ཏེ། །
en: After that he will appear among human beings

source: རྒྱལ་པོ་རྫུ་འཕྲུལ་ལྡན་པར་འགྱུར། །
en: And become a king with supernatural powers.

source: འཁོར་ལོས་སྒྱུར་བ་མི་ཡི་དབང་། །གླིང་བཞི་དག་གི་དབང་པོ་སྟེ། །
en: “He will be a king of the entire world, A chief of men, a lord of the four continents.

source: མི་ཡི་འཇིག་རྟེན་ཤི་འཕོས་ནས། །
en: After leaving the world of men,

source: ཚངས་པའི་འཇིག་རྟེན་འགྲོ་བར་འགྱུར། །
en: He will go to the world of the brahmā gods.

source: བསྐལ་པ་བྱེ་བ་ཉི་ཤུར་ནི། །རྟག་ཏུ་བསྟི་སྟང་བྱས་པར་འགྱུར། །
en: “For two hundred million eons He will be revered unceasingly,

source: ལྷ་ཡི་ནང་དང་མི་ནང་དུ། །ཡང་དང་ཡང་ནི་ཀུན་ཏུ་འགྲོ། །
en: Born again and again Among gods and human beings.

source: ཕྱིས་དེ་རྒྱལ་སྲིད་བོར་ནས་ནི། །ཁྱིམ་མེད་པར་ཡང་རབ་ཏུ་འབྱུང་། །
en: “Having left his kingdom behind And become a homeless renunciant,

source: རྐྱེན་གྱིས་བྱང་ཆུབ་ཐོབ་འགྱུར་ཏེ། །
en: The conditions will arise that will lead him to attain awakening,

source: དེར་ནི་མཐའ་ཡང་ཐུག་པར་འགྱུར། །
en: And he will reach sublimity.

source: གནོད་སྦྱིན་དག་ནི་སུམ་ཁྲི་རྣམས། །གནོད་སྦྱིན་སྐྱེ་གནས་འཕོས་གྱུར་ནས། །སུམ་ཅུ་རྩ་གསུམ་སྐྱེ་བར་འགྱུར། ། སངས་རྒྱས་ལ་ནི་གུས་བྱས་ནས། །
en: “Thirty thousand yakṣas, Having shown respect to the Buddha, Will go to the Heaven of the Thirty-Three When they pass on from their lives as yakṣas.

source: སངས་རྒྱས་བྱམས་པ་མཐོང་གྱུར་ཅིང་། །དེ་ན་མཐར་ནི་ཐུག་འགྱུར་ཏེ། །
en: “They will see the Buddha Maitreya, And work toward final sublimity.

source: དགྲ་བཅོམ་པ་ཡང་ཐོབ་འགྱུར་ན། །སྟོན་པ་ལ་ནི་སུ་མི་མཆོད། །
en: Who would not honor the teacher Whose teachings lead one to become an arhat?

source: གནོད་སྦྱིན་སྟོང་དུ་ཚང་བ་རྣམས། །བྱང་ཆུབ་མཆོག་ལ་རབ་ཞུགས་པས། །དེ་དག་དགེ་བའི་རྩ་བ་དེས། །ནམ་དུའང་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །
en: “Thousands of yakṣas Whose aim is supreme awakening, Because of their roots of virtue, Will never again go to the lower realms.

source: ཁ་ཅིག་སྲོག་ཆགས་ཀུན་ཕན་ཕྱིར། །བྱང་ཆུབ་དམ་པ་རབ་ཚོལ་ཞིང་། །སངས་རྒྱས་འདྲེན་པ་སྟོང་རྣམས་ལ། །བཀུར་སྟི་དག་ནི་བྱེད་པར་འགྱུར། །
en: “Some will turn for guidance To thousands of buddhas And seek the highest awakening For the benefit of all beings.

source: ཁ་ཅིག་སངས་རྒྱས་བྱང་ཆུབ་ཕྱིར། །སྟོང་ཕྲག་གཉིས་དང་གསུམ་དག་ཀྱང་། །མེ་ཏོག་ཕྲེང་བ་དྲི་རྣམས་ཀྱིས། །མཆོད་པ་དག་ནི་བྱེད་པར་འགྱུར། །
en: “Some two or three thousand Will make offerings Of fragrant garlands of flowers And create the conditions for their awakening as buddhas.

source: དག་པ་བསྒོམས་པའི་བདག་ཉིད་ཅན། །འདྲེན་པ་བྱེ་བ་ཕྲག་སྟོང་ལ། །ཁ་ཅིག་བཀུར་སྟི་བྱེད་འགྱུར་ཏེ། །འདི་དག་ཕྱིས་ནི་བྱང་ཆུབ་རེག །
en: “Some ten billion Will show reverence to the guides, Those personifications of perfected purity, And thus come within reach of awakening.

source: དེ་ན་ཅི་འཇིགས་དེ་ཡི་བུ། །རི་བོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཆེ། །
en: “The son of Kimbhīra, The great magician named Śaila,

source: འཇིག་རྟེན་སངས་རྒྱས་བདག་གྱུར་ཅེས། །དེས་ཀྱང་སེམས་ནི་བསྐྱེད་པར་གྱུར། །
en: Then thought to himself, ‘I should become a buddha in this world.

source: དེས་ནི་སངས་རྒྱས་བསྟི་སྟང་བྱས། །
en: “ ‘I have seen him show reverence to the Buddha

source: ཐམས་ཅད་དུ་ཡང་སྨོན་ལམ་བཏབ། །
en: And constantly make solemn commitments to him.

source: ང་མཐོང་ནས་ནི་མཆོད་བྱས་ཏེ། །
en: I, too, should make offerings

source: བྱང་ཆུབ་ཕྱིར་ནི་སེམས་བཏུད་དོ། །
en: And turn my mind toward awakening.’

source: དེ་ནི་དགེ་བའི་རྩ་བ་དེས། །
en: “Because of his roots of virtue,

source: ངན་འགྲོ་ཐམས་ཅད་སྤངས་གྱུར་ནས། །
en: He has managed to put an end to all painful rebirths.

source: སངས་རྒྱས་བྱམས་པ་མཐོང་ནས་ནི། །གདུགས་རྣམས་བྱེ་བ་འབུལ་བར་འགྱུར། །
en: When he sees the Buddha Maitreya, He will offer him ten million parasols.

source: གདུགས་རྣམས་བྱེ་བ་ཕུལ་ནས་ནི། །ན་བཟའ་བྱེ་བ་འབུལ་བར་འགྱུར། །
en: “After offering ten million parasols, He will present ten million garments.

source: ན་བཟའ་བྱེ་བ་ཕུལ་ནས་ནི། །དེ་ཉིད་དུ་ཡང་རབ་ཏུ་འབྱུང་། །
en: After offering ten million garments, He will become a renunciant.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་དམ་པ་རབ་ཚོལ་ཞིང་། །ལོ་ཡང་ལྔ་བརྒྱ་ཚང་བར་ནི། །ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་འགྱུར། །འདི་ལྟ་བུ་ཡི་རྣམ་གྲངས་ཀྱིས། །སྦྱིན་དང་ཚུལ་ཁྲིམས་ཡང་དག་སྤྱོད། །གང་གཱའི་བྱེ་མ་ཇི་སྙེད་པ། །དེ་སྙེད་བསྐལ་པར་སྤྱོད་པར་འགྱུར། །
en: “For a full five hundred years, He will live a life of purity, With supreme awakening For the benefit of all beings as his aim. “For as many eons As there are grains of sand in the Ganges, He will train himself in practices Such as generosity and morality.

source: དཔེར་གསུངས་པ་ནི་དེ་སྙེད་དུ། །དེ་དག་ཁྱེད་ཀྱིས་ཤེས་པར་གྱིས། །
en: “You should bear this in mind Just as I have taught it to you.

source: དེ་དག་དཔེར་ཡང་ཤེས་ནས་ནི། །དེ་བས་ལྷག་པར་སྤྱད་པར་གྱིས། །སྔར་ནི་དཔེ་རྣམས་གང་བརྗོད་པ། །གང་གཱ་ཡི་ནི་བྱེ་སྙེད་ཀྱི། །དེ་སྙེད་སངས་རྒྱས་མཐོང་གྱུར་ནས་དེ་དག་ཀུན་ལ་བསྟི་སྟང་བྱེད། །
en: You should not only bear these examples in mind But practice them. “As the old adage says, He will see as many buddhas As there are grains of sand in the Ganges, And he will show reverence to them all.

source: ཨེ་མའོ་ཡེ་ཤེས་ཨེ་མ་ཤེས། །ཨེ་མའོ་བླ་ན་མེད་པའི་སེམས། །
en: “O wise ones! O wise ones!

source: སེམས་ཅན་ཀུན་གྱི་འདྲེན་པ་ནི། །དེ་ལྟར་ཞུམ་པར་མི་འགྱུར་རོ། །
en: You whose minds are unsurpassed! You who are guides for all sentient beings— You never grow weary!

source: དེ་ཕྱིས་སེམས་ཅན་ཀུན་གྱི་མཆོག །སངས་རྒྱས་སུ་ཡང་དེ་འགྱུར་ཏེ། །
en: “He will become a buddha, Supreme among all sentient beings,

source: དེ་ནི་དེ་ཡི་མཚན་བཏགས་པ། །སྨན་པའི་རྒྱལ་པོར་རྣམ་པར་གྲགས། །
en: And be as widely esteemed As the king of physicians.

source: ལོ་ནི་བྱེ་བ་བདུན་ཅུར་ཡང་། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་བསྟན་ཏེ། །
en: “For seventy million years, He will teach the Dharma to living beings.

source: ཕྱིས་གདོད་རྐང་གཉིས་གཙོ་བོ་ནི། །དེ་ནས་མྱ་ངན་འདས་པར་འགྱུར། །
en: Then he will reach emancipation And become the best of men.

source: རབ་ཏུ་དུལ་བའི་སེམས་རྣམས་ཀྱི། །འདུས་པ་དག་ནི་ཉི་ཤུར་འགྱུར། །
en: “Twenty assemblies Of those who have tamed their minds will appear.

source: དེ་ལ་ཐ་མ་གཅིག་པོ་ནི། །དགེ་སློང་བྱེ་བ་ཉི་ཤུར་འགྱུར། །
en: Eventually, each will include Two hundred million mendicants.

source: འདུས་པ་རྣམས་ནི་གང་བརྗོད་པའི། །ཉན་ཐོས་དཔག་ཏུ་མེད་པ་སྟེ། །
en: “An immeasurable number of śrāvakas Will hear the teachings of these assemblies;

source: དེ་ཡི་ཉན་ཐོས་ཇི་སྙེད་པ། །བྱང་ཆུབ་ཞུགས་པའང་དེ་སྙེད་དོ། །
en: And all who listen Will reach awakening.

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་མཛད་ནས། །
en: “Having worked for the benefit of living beings,

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་འདས། །
en: The tathāgatas reach emancipation.

source: ལོ་ནི་བརྒྱ་ཕྲག་སྟོང་དག་ཏུ། །དེ་ཡི་དམ་ཆོས་གནས་པར་འགྱུར། །
en: For a hundred thousand years after that, The sacred teachings will remain.

source: བསྐལ་པ་ལྔ་བརྒྱ་ཚང་བར་ནི། །སངས་རྒྱས་མང་པོ་འབྱུང་བར་འགྱུར། །བསྐལ་པ་གཅིག་ལའང་འབྱུང་བ་ནི། །དེ་ན་སྟོང་རྣམས་འབྱུང་བར་འགྱུར། །
en: “For more than five hundred eons, Many buddhas will appear, And in just this single eon, One thousand will appear.

source: མི་རྣམས་མཁས་པ་གང་དག་ནི། །སངས་རྒྱས་ཆོས་རྣམས་བསྙེན་འདོད་པ། །ཚུལ་བཞིན་མང་དུ་ཐོས་པ་དང་། །རབ་ཏུ་འདུན་པ་ཉིད་དུ་བྱ། །
en: “Men who wish to gain insight Should strive with fervent determination To follow the Buddha’s teachings And become learned in what is essential.

source: ཚུལ་བཞིན་མ་ཡིན་རྣམ་པར་སྤོངས། །
en: “One should shun what is superficial

source: ཚུལ་བཞིན་ལ་ནི་རྟག་ཏུ་སྒོམས། །
en: And always cultivate what is essential.

source: མང་དུ་ཐོས་པ་རབ་ཏུ་བྱ། །
en: When one has listened for a long time,

source: དེས་ནི་ཤེས་རབ་རྣམ་པར་འཕེལ། །
en: One’s insight will flourish.

source: བྱང་ཆུབ་སེམས་དཔའ་སྐྱོབ་པ་ཡི། །རྩ་བའི་དོན་ནི་ཆོས་བཞི་སྟེ། །
en: “The four essential trainings Of the bodhisatvas, the protectors,

source: སྦྱིན་དང་ཚུལ་ཁྲིམས་ཐོས་དང་གཏོང་། །
en: Are generosity, morality, learning, and renunciation.

source: བྱང་ཆུབ་ཀྱི་ནི་ལམ་ལ་བཟང་། །
en: These are the best of all paths to awakening.

source: བླ་ན་མེད་པའི་ཐེག་པ་མཆོག །བྱང་ཆུབ་ཀྱི་ནི་ལམ་ཡང་བསྟན། །
en: “The path to awakening should be taught As the highest vehicle, the unsurpassed.

source: ཐེ་ཚོམ་གཅོད་པ་བཟང་པོ་ཡིས། །ཉན་ཐོས་ཀྱི་ནི་ལམ་བསྟན་ཏོ། །
en: The path of the śrāvaka should be taught As the best way of severing doubt.

source: སེམས་ཅན་གང་དག་འདི་འདོད་པ། །དེ་ལ་ངས་ནི་སྐབས་དབྱེའོ། །
en: “I reveal this for those beings Who desire it.

source: ཆོས་རྣམས་ཀྱི་ནི་མཆོག་སྟོན་པ། །འཇིག་རྟེན་སྣང་མཛད་རྙེད་པར་དཀའ། །
en: It is difficult to encounter the illuminators of the world, Those who can teach the supreme Dharma.”

source: དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། ། བཅོམ་ལྡན་འདས་འདི་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གཤེགས་ཞེས་གྲག་གིས། །བདག་གིས་བཅོམ་ལྡན་འདས་ལ་དགེ་བའི་རྩ་བ་རྒྱ་ཆེན་པོ་ཞིག་སྐྱེད་དོ་སྙམ་མོ། །
en: Śaila, the son of the yakṣa Kimbhīra, then thought to himself, “The Lord will ascend Vulture’s Peak, the king of mountains. I must create a vast, meritorious root of virtue in the presence of the Lord.”

source: དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོས་རང་གི་འཁོར་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གཤེགས་ཀྱིས། དེ་ལ་གྲོགས་པོ་དག་མཐུ་ཅི་ཡོད་པ་དང་། ཅི་ནུས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ལ་སྤྲོ་བ་སྐྱེད་ཅིག །
en: The yakṣa Śaila, Kimbhīra’s son, then addressed his companions: “Friends, listen! The Lord is traveling from the great city of Rājagṛha toward Vulture’s Peak, the king of mountains. Friends! You should make an effort to worship the Lord according to your strength and capability.”

source: དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོ་གཡོག་དང་བཅས་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བཟུང་སྟེ། རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་བར་གྱི་ལམ་དེ་ཐམས་ཅད་གསེག་མ་དང་། གྱོ་མོ་དང་། སྡོང་དུམ་དང་། ཚེར་མ་རྣམས་མེད་པར་བྱས་སོ། ། མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟར་དག་པར་བྱས་སོ། ། ལམ་དེ་དག་ཐམས་ཅད་བསལ་ནས་སྤོས་ཀྱི་ཆུས་ཀུན་ཏུ་ཆག་ཆག་བཏབ་བོ། །ལམ་དེར་གོས་ནི་མཚམས་མེད་པར་བཏིང་ངོ་། ། ལམ་དེར་མི་གང་ཙམ་དུ་མེ་ཏོག་གིས་ཆལ་པར་བཀྲམ་མོ། ། ལམ་དེ་དག་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་ཤིན་ཏུ་བརྒྱན་ཏོ། ། ལམ་དེ་བདུག་སྤོས་དམ་པའི་སྙིང་པོ་རབ་ཀྱི་སྣོད་ནས་བདུགས་སོ། ། སྟེང་གི་བར་སྣང་ལས་དར་གྱི་ལྔ་ལྡིར་སྦྱངས་ཏེ། ཤིན་ཏུ་བརྒྱན་ཏོ། ། ལམ་དེར་སིལ་སྙན་སྣ་ཚོགས་ཀྱི་སྒྲ་འཁྲོལ་བར་བྱས་སོ། །
en: Kimbhīra’s son Śaila, together with his companions, then cleared the path between the great city of Rājagṛha and Vulture’s Peak, the king of mountains, clearing it of rocks, pebbles, roots, and thorns. He made it as spotless as a mirror, and when the whole path was cleared, he sprinkled it with scented water. He then covered the path completely with fabric and scattered flowers to the height of a man. He adorned the path with parasols, banners, and flags, and along its length he burned fragrant incense in exquisite containers. In the space above the path he strung silken streamers, and he filled the air with the tones and sounds of all kinds of instruments. Along the path he spread blue, pink, red, and white lotus flowers to the breadth of an arrow’s shot. He placed golden tiles on the path and laid out a golden lattice of the seven precious substances.
